Repository: share-extras/langpack-cy
Catalog: core/tmx/web-client.tmx
Source language: en_us
Languages: cy

source: Modify the message then click OK.
cy: Newidiwch y neges a chliciwch Iawn.

source: Manage User Groups
cy: Rheoli Grwpiau Defnyddiwr

source: Monitors the progress of a deployment to one or more servers.
cy: Monitro cynydd darpariaeth i un neu fwy o gweinyddion.

source: New Edition
cy: Argraffiad Newydd

source: Demonstration
cy: Arddangosiad

source: Set condition values
cy: Gosod gwerthoedd amod

source: Step Five - Configure Workflow
cy: Cam Pump - Ffurfweddu Llif Gwaith

source: Space Type
cy: Math Lle

source: Close
cy: Cau

source: RSS Feed
cy: Porthiant RSS

source: Discard Template
cy: Taflu Templed

source: Browse Files
cy: Pori Ffeiliau

source: Step Three - Summary
cy: Cam Tri - Crynodeb

source: Modify Properties of
cy: Newid Priodweddau

source: Task Properties
cy: Priodweddau Tasg

source: This category has {0} existing document(s) linked to it.
cy: Mae gan y categori hwn {0} dogfennau cyfredol wedi cysylltu iddo.

source: Check out this document
cy: Gwirio allan y dogfen yma

source: Permanently delete an item from the deleted file store
cy: Dileu eitem o'r stôr ffeiliau wedi'u dileu am byth

source: User - Summary
cy: Defnyddiwr - Crynodeb

source: Delete Category
cy: Dileu Categori

source: Create Space
cy: Creu Lle

source: Snapshot ''{0}'' created for sandbox: {1}
cy: Crëwyd ciplun "{0}" ar gyfer blwch tywod: {1}

source: Configure the workflow settings and parameters
cy: Ffurfweddu gosodiadau a baramedrau y llif gwaith

source: Next
cy: Nesaf

source: To remove an invited user from this space, click Yes.
cy: I dynnu defnyddiwr gwahoddedig o'r lle yma, cliciwch Ie.

source: To regenerate renditions based on your selection, click next.
cy: I ail-gynhyrchu lluniadau yn seiliedig ar eich dewisiad, cliciwch Nesaf.

source: Delete Web Project
cy: Dileu Project Gwe

source: Deleted Item Details
cy: Manylion Eitem wedi'i Dileu

source: Editor
cy: Golygydd

source: List of your completed tasks
cy: Rhestr o'ch tasgau a gwblhawyd

source: Specify the name and select the type of content you wish to create.
cy: Dewiswch yr enw a'r math o gynnwys a ydych eisiau creu.

source: Use Template
cy: Defnyddio Templed

source: Provide details of the Alfresco Server Receiver to add
cy: Darparu manylion y Derbyniwr Gweinydd Alfresco i ychwanegu

source: Failed to run Actions due to error: {0}
cy: Methwyd rhedeg Gweithredoedd oherwydd gwall: {0}

source: A locale must be defined for this node.
cy: Rhaid diffinio lleoleiddiad ar gyfer y nôd yma.

source: Include In Auto Deploy
cy: Cynnwys yn Hunan Darparu

source: Logout
cy: Allgofnodi

source: This view allows you to browse topics in this forum.
cy: Mae'r golwg yma yn caniatáu i chi pori'r pynciau yn y fforwm yma.

source: To edit the file in the future click the Edit action
cy: I golygu'r ffeil yn y dyfodol cliciwch y gweithred Golygu

source: Select Type
cy: Dewis Math

source: Create Topic
cy: Creu Pwnc

source: Modify Forum Properties
cy: Newid Priodweddau Fforwm

source: Update a document on the repository with content from your computer.
cy: Diweddaru ffeil yn y repositori gyda chynnwys o'ch cyfrifiadur.

source: This wizard helps you to create a new space.
cy: Mae'r dewin yma yn eich cynorthwyo i greu lle newydd.

source: Update File Content
cy: Diweddaru Cynnwys Ffeil

source: Web Project Details of
cy: Manylion Project Gwe o

source: Edit Simple Workflow
cy: Golygu Llif Gwaith Syml

source: This wizard helps you to edit a content item for a website.
cy: Mae'r dewin yma yn eich cynorthwyo i olygu eitem cynnwys tu mewn safle gwe.

source: Unable to paste item due to system error:
cy: Methu gludo'r eitem oherwydd gwall system:

source: Working Copy No Longer Available
cy: Copi Gweithio Dim ar Gael Bellach

source: Username must be between {0} and {1} characters in length.
cy: Rhaid i hyd yr enw defnyddiwr fod rhwng {0} a {1} llythrennau

source: Visual Comparison
cy: Cymhariaeth Gweledol

source: This form is currently configured for the following web projects:
cy: Mae'r ffurflen yma wedi ei ffurfweddu ar gyfer y projectau gwe dilynol yn bresennol.

source: All Formats
cy: Pob Fformat

source: Add an existing User to a Group
cy: Ychwanegu defnyddiwr cyfredol i grŵp

source: Today
cy: Heddiw

source: Fixed
cy: Gosodedig

source: Include Children
cy: Cynnwys Plant

source: View Deployment Attempt
cy: Gweld Cais Darpariaeth

source: Post to Topic
cy: Postio i Bwnc

source: Details of
cy: Manylion

source: Select the type of space you want to create.
cy: Dewiswch y math o lle hoffech eich creu

source: Please correct the errors below then click New Category.
cy: Cywirwch y wallau isod a chliciwch Categori Newydd, os gwelwch yn dda.

source: Paste
cy: Gludo

source: Open Network Folder
cy: Agor Ffolder Rhwydwaith

source: Translation author
cy: Awdur cyfieithiad

source: Please correct the errors below then click Create Topic.
cy: Cywirwch y wallau isod a chliciwch Creu Pwnc, os gwelwch yn dda.

source: Choose Workflow
cy: Dewis Llif Gwaith

source: Select Action
cy: Dewis Gweithred

source: Submit Now
cy: Cyflwyno Rŵan

source: Unable to delete Space due to system error:
cy: Methu dileu'r Lle oherwydd gwall system:

source: Hide or Show the Sidebar
cy: Cuddio neu ddangos y Bar Ochr

source: Undo
cy: Dadwneud

source: Create Group
cy: Creu Grŵp

source: Templates
cy: Templedi

source: Node Browser Search Results
cy: Canlyniadau Chwiliad Porwr Nôd

source: Name
cy: Enw

source: Select and configure workflow for non-form generated assets.
cy: Dewis a ffurfweddu y llif gwaith ar gyfer asedau sydd heb eu cynhyrchu gyda ffurflen.

source: Use the following pattern when saving content
cy: Defnyddiwch y patrwm dilynol wrth gadw cynnwys

source: Start Advanced Workflow
cy: Cychwyn Llif Gwaith Uwch

source: HTTP Session State
cy: Cyflwr Sesiwn HTTP

source: Step One - Web Form Details
cy: Cam Un - Manylion Ffurflen Gwe

source: Repository Properties
cy: Priodweddau Repositori

source: <Select a language>
cy: <Dewis Iaith>

source: Configure Dashboard Wizard
cy: Dewin Ffurfweddu Gwibfwrdd

source: Edition Details
cy: Manylion Argraffiad

source: Failed to create Rule due to error: {0}
cy: Methwyd creu'r Rheol oherwydd gwall: {0}

source: Submit All
cy: Cyflwyno Pob Un

source: A place to discuss content with other users.
cy: Lle i drafod cynnwys gyda defnyddwyr arall.

source: File name pattern
cy: Patrwm enw ffeil

source: Select users and their roles.
cy: Dewiswch defnyddwyr a'u rolau.

source: Step Two - Summary
cy: Cam Dau - Crynodeb

source: Edit Forum Space Details
cy: Golygu Manylion Lle Fforwm

source: The information you entered is shown below.
cy: Mae'r gwybodaeth a roddoch wedi ei ddangos isod.

source: No selected items.
cy: Dim eitemau wedi'u ddewis

source: Use copy uploaded from my computer
cy: Defnyddio copi a lwythwyd i fyny o fy nghyfrifiadur

source: Company ID
cy: ID Cwmni

source: Path
cy: Llwybr

source: No items to display
cy: Dim eitemau i ddangos

source: Are you sure you want to delete "{0}" and all previous versions? Its multilingual properties will not be recoverable.
cy: A ydych chi'n siŵr eich bod eisiau dileu "{0}" a phob fersiwn blaenorol? Ni fydd ei priodweddau amlieithog yn adferadwy.

source: This view allows you to browse and modify the categories hiearchy.
cy: Mae'r golwg yma yn eich caniatáu i bori a newid y gradd categorïau.

source: A copy of the file ''{0}'' is now checked out to you for editing.
cy: Mae copi o'r ffeil "{0}" wedi ei gwirio allan i chi olygu.

source: Select a Saved Search...
cy: Dewis Chwiliad a Gadwyd

source: No deployment servers have been configured.
cy: Nid oes unrhyw gweinyddion darpariaeth wedi ffurfweddu.

source: Check in content as ''{0}'' with comment ''{1}''
cy: Gwirio i fewn cynnwys fel "{0}" gyda sylwad "{1}"

source: Provides ability to search across multiple OpenSearch supported search engines.
cy: Darparu'r gallu i chwilio ar draws peiriannau OpenSearch lluosol.

source: Email Space users
cy: Anfon e-bost i ddefnyddwyr y lle

source: Delete Listed Items
cy: Dileu Eitemau a Restrir

source: Take Ownership
cy: Cymryd Perchenogaeth

source: Page {0} of {1}
cy: Tudalen {0} o {1}

source: Email
cy: E-bost

source: Username disallowed - please try again later and/or contact your system administrator.
cy: Enw defnyddiwr wedi ei wahardd - ceisiwch eto yn hwyrach neu gysylltwch â'ch gweinyddwr system.

source: Duration:
cy: Cyfnod

source: <no schema selected>
cy: <dim sgema wedi ei ddewis>

source: Item has aspect ''{0}''
cy: Agwedd "{0}" gan yr eitem

source: Based on an existing space
cy: Fel lle cyfredol

source: Author
cy: Awdur

source: Are you sure you want to recover all the deleted files and spaces from the deleted file store?
cy: A ydych chi'n siŵr eich bod eisiau adfer pob ffeil a lle o'r stôr ffeiliau wedi'u dileu?

source: Create New Content
cy: Creu Cynnwys Newydd

source: Link Validation Report for {0}''s Sandbox
cy: Adroddiad Dilysu Cysylltiadau ar gyfer Blwch Tywod {0}

source: System Information
cy: Gwybodaeth System

source: Enter message text to reply then click Reply.
cy: Mewnbynnwch cynnwys yr ateb a chliciwch Ateb.

source: This group has {0} sub-group(s) or user(s) attached to it.
cy: Mae gan y grŵp hwn {0} is-grŵp(iau) neu ddefnyddiwr(wyr) wedi'u atodi iddo.

source: Create
cy: Creu

source: Check in your working copy for other team members to work with.
cy: Gwirio i fewn eich copi gweithio er mwyn i aelodau tîm arall cael gweithio arno.

source: Successfully unlocked the document.
cy: Wedi datgloi'r dogfen yn llwyddiannus.

source: Add a translation to the document's properties.
cy: Ychwanegu cyfieithiad i briodweddau y ddogfen

source: Administration Console
cy: Consol Gweinyddiaeth

source: Modify the information about the multilingual content.
cy: Newidiwch y wybodaeth am y cynnwys amlieithog.

source: Failed to delete User due to error: {0}
cy: Methu dileu'r Defnyddiwr oherwydd gwall system: {0}

source: Are you sure you want to permanently delete the following deleted files and spaces from the deleted file store? The items cannot be recovered once this action has been performed.
cy: A ydych chi'n siŵr eich bod eisiau dileu am byth y ffeiliau a ffolderau dilynol o'r stôr ffeiliau wedi'u dileu? Ni allir adfer yr eitemau ar ôl berfformio'r gweithred yma.

source: Edit Forum Details
cy: Golygu Manylion Fforwm

source: More search options
cy: Dewisiadau chwiliad ychwanegol

source: Browse Content
cy: Pori Cynnwys

source: Edition
cy: Argraffiad

source: Created On
cy: Crëwyd Ar

source: Workflow parameters have not been fully configured, cannot submit items.
cy: Nid yw paramedrau llif gwaith wedi eu ffurfweddu, methu cyflwyno eitemau.

source: Deleted Items
cy: Eitemau wedi'u Dileu

source: Locate document to upload
cy: Lleoli'r dogfen i llwytho i fyny

source: Workflow Console
cy: Consol Llif Gwaith

source: HTTP Request Headers
cy: Penawdau Cais HTTP

source: Which copy do you want to check in?
cy: Pa copi a ydych eisiau eisiau gwirio i fewn?

source: by
cy: gan

source: Create a new root Webapp folder for this web project
cy: Creu cymhwysiad gwe gwreiddiol newydd yn y project gwe yma

source: Content Launch
cy: Lansiad Cynnwys

source: Unable to find form {0} associated with {1}.
cy: Methu canfod y ffurflen {0} sydd wedi'i cysylltu gyda {1}.

source: Assigned To
cy: Neilltuwyd I

source: This view allows you to see the results from your search.
cy: Mae'r golwg yma yn eich caniatáu i weld canlyniadau eich chwiliad.

source: Completed on
cy: Wedi Cwblhau ar

source: Release Server
cy: Rhyddhau Gweinydd

source: Check Out
cy: Gwirio Allan

source: Select a template to be applied to the Space as a Custom view.
cy: Dewiswch templed i rhoi i'r lle fel golwg addasiedig.

source: Icon View
cy: Golwg Eicon

source: This dialog allows the task to be managed.
cy: Mae'r deialog yma yn galluogi i chi rheoli'r tasg

source: Check In options
cy: Dewisiadau Gwirio i Fewn

source: Source
cy: Ffynhonnell

source: There is no metadata to collect for this particular workflow.
cy: Nid oes yna unrhyw metadata i gasglu ar gyfer y llif gwaith yma.

source: Unable to delete the User object associated with the Person. This is not an error if an external authentication mechanism such as NTLM was previously active.
cy: Methu dileu'r gwrthrych Defnyddiwr sydd wedi'i gysylltu â'r Berson. Nid yw hwn yn gwall os oedd mecanwaith dilysiant allanol fel NTLM yn gweithredol ynghynt.

source: Versioned details of
cy: Manylion fersiynnol

source: Category Properties
cy: Priodweddau Categori

source: Resources
cy: Adnoddau

source: {0} must contain a number.
cy: Rhaid i {0} cynnwys rhif.

source: Modify the content properties then click OK.
cy: Newidiwch priodweddau y cynnwys a chliciwch Iawn.

source: To remove this file and any previous versions, click OK.
cy: I gwaredu'r ffeil yma ac unrhyw fersiwn blaenorol, cliciwch Iawn.

source: Deleted by User
cy: Wedi Dileu gan Defnyddiwr

source: Edit Content Properties
cy: Golygu Priodweddau Cynnwys

source: Group ID cannot contain the characters: {0}
cy: Ni chaiff y dynodiad grŵp cynnwys y nodau: {0}

source: To edit the file ''{0}'', click the link below and if asked select Save.
cy: I olygu'r ffeil "{0}", cliciwch y cyswllt isod ac os gofynnir dewiswch Cadw.

source: New Password
cy: Cyfrinair Newydd

source: Use as a template?
cy: Defnyddiwch fel templed?

source: Alfresco Web Client - Category Browsing
cy: Dibynnydd Gwe Alfresco - Pori Categorïau

source: Ignore Inherited Rules
cy: Anwybyddu Rheolau Etifeddedig

source: Use this view to browse the files and folders within the sandbox for a web project.
cy: Defnyddiwch yr olwg yma i bori'r ffeiliau a ffolderau yn y blwch tywod.

source: Locate the .acp or .zip file to upload
cy: Lleoli'r ffeil .acp neu .zip i lwytho i fyny

source: Show Template Web Projects
cy: Dangos Templedi Project Gwe

source: In Category Condition
cy: Amod Mewn Categori

source: From scratch
cy: O'r newydd

source: In the current space
cy: Yn y lle cyfredol

source: Can not find an ACP file to import!
cy: Methu canfod ffeil ACP i fewnforio!

source: Save as a public search available to all users.
cy: Cadw fel chwiliad cyhoeddus ar gael i bob defnyddiwr.

source: Outcome
cy: Canlyniad

source: Unable to add a translation without content.
cy: Methu ychwanegu cyfieithiad heb gynnwys.

source: Link Destination Details
cy: Manylion Cyrchfan Cyswllt

source: to prevent the possibility of other users overwriting your changes.
cy: er mwyn atal y posibilrwydd o defnyddwyr arall dros-ysgrifennu eich newidiadau.

source: User - Person Properties
cy: Defnyddiwr - Priodweddau Person

source: Enter Login details
cy: Mewnbynnwch Manylion Mewngofnodi

source: Regenerate Renditions
cy: Ail-gynhyrchu Lluniadau

source: Download Content
cy: Lawrlwytho Cynnwys

source: Manage the users of the repository.
cy: Rheoli defnyddwyr y repositori

source: Icon
cy: Eicon

source: This server has not been selected as the snapshot has already been deployed successfully.
cy: Nid yw'r gweinydd yma wedi cael ei dewis gan fod y ciplun wedi cael ei ddarparu yn llwyddiannus yn barod.

source: Reviewer
cy: Adolygydd

source: To delete this user from the system, click Yes.
cy: I waredu'r defnyddiwr yma o'r system, cliciwch Ie.

source: Modified Items
cy: Eitemau Newidiwyd

source: Item locked by you
cy: Eitem wedi ei gloi gan chi

source: To cancel this workflow, click OK.
cy: I diddymu'r llif gwaith yma, cliciwch Iawn

source: Check Out File
cy: Gwirio Allan Ffeil

source: No Access
cy: Heb Cyrchiad

source: Send an email to the users and groups assigned to this space.
cy: Anfon e-bost i'r defnyddwyr a grwpiau wedi eu neilltuo i'r lle yma.

source: {0} broken link(s) were found in {1} file(s).
cy: {0} cysylltiadau toredig wedi eu canfod mewn {1} ffeil(iau).

source: of
cy: o

source: Are you sure you want to undo the changes to the selected files in from the sandbox?
cy: A ydych chi'n siŵr eich bod eisiau dadwneud y newidiad i'r ffeiliau dewiswyd yn y blwch tywod?

source: Scratch
cy: Newydd

source: More Actions for this Document
cy: Mwy o ddewisiadau i'r Dogfen yma

source: Start Advanced Workflow Wizard
cy: Dewin Cychwyn Llif Gwaith Uwch

source: Click here to select the Home Space location
cy: Cliciwch yma i ddewis y lleoliad Lle Cartref

source: Major Change
cy: Newid Mawr

source: Recover Item
cy: Adfer Eitem

source: To close this wizard and create your space click Finish. To review or change your selections click Back.
cy: I gau'r dewin yma a chreu eich lle cliciwch Gorffen. I adolygu neu i newid eich dewisiadau cliciwch Nôl.

source: Use this view to change an existing user password.
cy: Defnyddiwch y golwg yma i newid cyfrinair defnyddiwr.

source: Failed to remove User due to error: {0}
cy: Methwyd gwaredu'r Defnyddiwr oherwydd gwall system: {0}

source: Navigation
cy: Llywio

source: Create New Content - Properties
cy: Creu Cynnwys Newydd - Priodweddau

source: Search failed as the system was unable to process your query, please try a different search.
cy: Methwyd y chwiliad achos ni oedd y system yn gallu prosesu eich ymholiad. Ceisiwch ymholiad gwahanol, os gwelwch yn dda.

source: Import Directory
cy: Cyfeiriadur Mewnforio

source: Permanently delete all files and spaces from the deleted file store
cy: Dileu pob ffeil a lle o'r stôr ffeiliau wedi'u dileu

source: current working version
cy: fersiwn gweithio presennol

source: This space is not categorized.
cy: Nid yw'r dogfen wedi ei gategoreiddio.

source: Required format
cy: Fformat angenrheidiol

source: Selected Web Content Forms
cy: Dewiswch Ffurflenni Cynnwys Gwe

source: The folder item referenced by Id: {0} - has been deleted from the database. The system has changed your folder location as the folder you were in no longer exists.
cy: Mae'r eitem ffolder a gyfeiriwyd gan Id: {0} - wedi ei ddileu o'r gronfa ddata. Mae'r system wedi newid eich lleoliad ffolder achos nid yw'r ffolder a oeddech chi tu fewn yn bodoli bellach.

source: My Saved Search Options
cy: Fy Newisiadau Chwiliad a Cadwyd

source: System Properties
cy: Priodweddau System

source: Message
cy: Neges

source: {0} is invalid.
cy: Mae {0} yn annilys.

source: Item locked by {0,choice,0#SHOULD_NOT_HAPPEN|1#user|1<users}
cy: Eitem wedi ei gloi gan {0,choice,0#SHOULD_NOT_HAPPEN|1#defnyddiwr|1<defnyddwyr}

source: Snapshot not created - the sandbox has not been modified since the last snapshot.
cy: Ciplun heb ei greu - nid yw'r blwch tywod wedi eu newid ers i'r creu'r ciplun olaf cael ei greu.

source: Are you sure you want to delete "{0}" and all previous versions?
cy: A ydych chi'n siŵr eich bod eisiau dileu "{0}" a phob fersiwn blaenorol?

source: Select the Web Form to use for editing this file
cy: Dewis y ffurflen gwe i ddefnyddio i olygu'r ffeil yma

source: Step Two - Select Components
cy: Cam Dau - Dewis Cyfansoddion

source: File names and contents
cy: Enwau ffeil a chynnwys

source: Remove Item
cy: Gwaredu Eitem

source: Space Rules
cy: Rheolau Lle

source: Edit XML File Inline
cy: Golygu Ffeil XML Mewn-lein

source: Unable to cancel the workflow due to system error:
cy: Methu diddymu'r llif gwaith oherwydd gwall system:

source: Recent Snapshots
cy: Cipluniau Diweddaraf

source: Apply Template
cy: Gosod Templed

source: Select XML schema to use
cy: Dewiswch y sgema XML i defnyddio

source: Groups Management
cy: Rheolaeth Grwpiau

source: You have no access to Alfresco.
cy: Nid oes gennych cyrchiad i Alfresco.

source: Delete
cy: Dileu

source: This wizard helps you start an advanced workflow for an item in the repository.
cy: Mae'r dewin yma yn eich cynorthwyo i cychwyn llif gwaith uwch ar gyfer eitem yn y repositori.

source: The rules have been successfully reapplied.
cy: Mae'r rheoli wedi eu ailgymhwyso'n llwyddiannus.

source: Size
cy: Maint

source: Modify the forum properties then click OK.
cy: Newidiwch priodweddau'r fforwm a chliciwch Iawn.

source: Failed to retrieve search results for '{0}'
cy: Methwyd nôl canlyniadau ar gyfer chwiliad '{0}'

source: Inherited rules are being ignored.
cy: Anwybyddir rheolau etifeddedig.

source: Your Searches
cy: Chwiliadau Chi

source: Paste All
cy: Gludo Pob Un

source: This page helps you to submit modified items for publishing on the website.
cy: Mae'r tudalen yma yn eich cynorthwyo i gyflwyno eitemau a newidiwyd er mwyn cyhoeddi ar y safle gwe.

source: Search for and select an item.
cy: Chwilio am a dewis eitem.

source: View deployment details for each of the servers selected in the deployment.
cy: Gweld manylion darpariaeth ar gyfer pob un o'r gweinyddion dewiswyd yn y ddarpariaeth.

source: Step Three - Configure Web Content Forms
cy: Cam Tri - Ffurfweddu Ffurflenni Cynnwys Gwe

source: Failure Reason
cy: Rheswm Methiant

source: Displays a list of the documents checked out to me
cy: Dangosir rhestr o'r dogfennau sydd wedi eu gwirio allan i fi

source: Browse Forum Spaces and Forums
cy: Pori Lleoedd Fforwm a Fforymau

source: The Home Space node referenced by Id: {0} cannot be found. It may have been deleted from the database. Please contact your system administrator.
cy: Methu canfod y Lle Cartref a gyfeiriwyd gan Id: {0}. Efallai bod o wedi'i dileu o'r cronfa ddata. Cysylltwch â'ch gweinyddwr system, os gwelwch yn dda.

source: Check out location
cy: Lleoliad gwirio allan

source: User ID cannot contain the characters: {0}
cy: Ni chaiff y dynodiad defnyddiwr cynnwys y nodau: {0}

source: To edit this file using a Web Form, click here.
cy: I olygu'r ffeil yma gyda Ffurflen Gwe, cliciwch yma.

source: Manage the permissions you have granted to users who access your space.
cy: Rheoli'r caniatadau sydd wedi wedi eu rhoi i ddefnyddwyr sy'n cyrchu eich lle.

source: To edit the working copy of the file, click the link below and if asked select Save.
cy: I olygu'r copi gweithio o'r ffeil, cliciwch y cyswllt isod ac os gofynnir dewiswch Cadw.

source: View Details for file
cy: Gweld Manylion y ffeil

source: Forum
cy: Fforwm

source: Yes
cy: Ie

source: Save Location
cy: Lleoliad Cadw

source: Rules applied to this content may require you to enter additional information.
cy: Efallai bydd rheoli sydd wedi eu osod ar y cynnwys yma yn angen chi i fewnbynnu mwy o wybodaeth.

source: Invite new users and create sandboxes for the Web Project.
cy: Gwahodd defnyddwyr newydd a chreu blychau tywod ar gyfer y Gywaith Gwe.

source: Working copy location
cy: Lleoliad copi gweithio

source: Select an item
cy: Dewis eitem

source: Create New Content - Summary
cy: Creu Cynnwys Newydd - Crynodeb

source: Failed to apply the ''inlineeditable'' aspect to the document due to system error: {0}
cy: Methwyd gosod yr agwedd "inlineeditable" i'r ddogfen oherwydd gwall system: {0}

source: View in CIFS
cy: Gweld mewn CIFS

source: Reason
cy: Rheswm

source: Return to application
cy: Dychwelyd i'r cymhwysiad

source: Owner
cy: Perchennog

source: Manage Content Rules
cy: Rheoli Rheolau Cynnwys

source: Target Path
cy: Llwybr Targed

source: Current Webapp Folder
cy: Ffolder Cymhwysiad Gwe

source: Refresh
cy: Ail-lwytho

source: Revert
cy: Dychwelyd

source: Translation language
cy: Iaith cyfieithiad

source: Edit Category
cy: Golygu Categori

source: Web Content Forms
cy: Ffurflenni Cynnwys Gwe

source: No forum spaces or forums to display. Click the ''Create Forum Space'' action to create a forum space or ''Create Forum'' action to create a forum.
cy: Dim lleoedd fforwm neu fforymau i ddangos. Cliciwch y gweithred "Creu Lle Fforwm" i greu lle fforwm neu "Creu Fforwm" i greu fforwm.

source: To remove this web project and all associated user sandboxes, click OK.
cy: I waredu'r project gwe yma a phob blwch tywod defnyddiwr cysylltiedig, cliciwch Iawn.

source: Source Path
cy: Llwybr Ffynhonnell

source: Deployment Failed
cy: Methodd Ddarparu
